
var floor,nowX,nowY;
var map = [],p1;
for(var i=0;i<10;i++){
    map[i] = [];
    for(var j=0;j<10;j++){
        map[i][j] = [];
    }
}
var imgP1 = [$("#p1-left")[0],$("#p1-up")[0],$("#p1-right")[0],$("#p1")[0]];
var $floor = $("#player-panel").find("h1");
var ground = [
    $("#f1")[0],
    $("#f1")[0],
    $("#f1")[0],
    $("#w2")[0],
    $("#w2")[0],
    $("#w2")[0],
    $("#w2")[0],
    $("#f1")[0],
    $("#f1")[0],
    $("#f1")[0]
];
var boss1 = function () {
    talk = ["恶魔：哈哈哈哈！","恶魔：你居然能打败我！但我要将你拖入永恒的黑暗！","勇士:……"];
    $speak.show();
    ctx.fillRect(0,0,mainW,mainH);
    maze(0,0,3);
};
// id, img, ATK, DEF, HP, jingyan, money, name,  ability      怪  具体样子参照assets文件中同名图片
var m1 = new Monster("m1",$("#m1")[0],8,2,50,10,2,"小恶魔");
var m2 = new Monster("m2",$("#m2")[0],15,6,80,25,4,"双头恶魔");
var m3 = new Monster("m3",$("#m3")[0],30,8,70,30,6,"女巫");
var m4 = new Monster("m4",$("#m4")[0],30,12,200,55,8,"蜘蛛女妖");
var m5 = new Monster("m5",$("#m5")[0],40,20,300,70,12,"恶魔头领");
var m6 = new Monster("m6",$("#m6")[0],50,28,400,90,15,"食人魔头领");
var m7 = new Monster("m7",$("#m7")[0],55,42,600,140,20,"荆棘女王");
var m8 = new Monster("m8",$("#m8")[0],70,38,690,160,23,"蛟龙女王");
var m9 = new Monster("m8",$("#m9")[0],120,80,1200,444,0,"魔主",boss1);
//id, img, ATK, DEF, HP, jingyan, money, name, speak     可以加成负状态
var g1 = new Goods("g1",$("#g1")[0],0,0,50,0,0,"小血瓶");      //  绿水壶
var g2 = new Goods("g2",$("#g2")[0],3,0,0,0,3,"圣杯");    //  圣杯
var g3 = new Goods("g3",$("#g3")[0],8,-5,-50,0,0,"恶魔之壶");  //  紫壶
var g4 = new Goods("g4",$("#g4")[0],0,2,0,0,3,"小圣杯");  //  高脚圣杯 比圣杯丑
var g5 = new Goods("g5",$("#g5")[0],5,5,55,25,25,"魔力之泉");  //  里面汤好像很有魔力的黑水壶
var g6 = new Goods("g6",$("#g6")[0],0,6,0,0,0,"布衣");         //衣服初级
var g7 = new Goods("g7",$("#g7")[0],0,12,100,0,0,"钢甲");         //衣服中级
var g8 = new Goods("g8",$("#g8")[0],0,18,500,0,0,"黄金甲");         //衣服高级
var g9 = new Goods("g9",$("#g9")[0],8,0,0,0,0,"巨斧");         //武器初级
var gA = new Goods("g10",$("#g10")[0],15,0,0,50,0,"夜魅刀");      //武器中级
var gB = new Goods("g11",$("#g11")[0],25,0,0,0,0,"折断的海神戟");      //武器高级
var w1 = {id : "w1", img : $("#w1")[0]};    //黄墙
var w2 = {id : "w2", img : $("#w2")[0]};    //灰墙
var w3 = {id : "w2", img : $("#w3")[0]};    //蓝墙
var w4 = {id : "w2", img : $("#w4")[0]};    //岩浆
var w5 = {id : "w2", img : $("#w5")[0]};    //草地
var up = {id : "up", img : $("#up")[0]};     // 上楼
var dn = {id : "dn", img : $("#up")[0]};     // 下楼
var rd = {id : "rd", img : $("#rd")[0]};     // 传送门（1-10层）
var st = {id : "st", img : $("#st")[0]};
// var yp = {id : "yp", img : $("#win"[0])};
function init() {
    //  id, img, ATK, DEF, HP, money, imgArr, name, key ,lv
    p1 = new Player("p1",$("#p1")[0],10,2,200,0,imgP1,"勇士",0);
    floor = 0;
    map = [
        [
            [up,"","","","","","",m1,m1,g2],    //1
            [w1,w1,w1,w1,m2,w1,w1,w1,w1,w1],
            ["","","","","",m1,g1,m4,m5,g5],
            [w1,"",w1,"",w1,m1,w1,w1,w1,w1],
            [w1,m1,w1,"",w1,g1,"",m1,m2,g4],
            [w1,g1,w1,m1,"",w1,"","",g1,m2],
            [w1,"",w1,g4,m1,w1,w1,m1,m2,g2],
            [w1,m2,w1,w1,m1,"",w1,"",m1,w1],
            [m3,"",m1,w1,"",m1,w1,m1,g2,w1],
            [g6,m3,g3,w1,g2,p1,w1,g1,m1,w1]
        ],
        [
            [dn,w3,m3,m3,m3,w3,g1,g2,g1,w3],    //2
            [p1,w3,m3,gA,m3,w3,m3,m3,m3,w3],
            ["",w3,m3,m3,m3,w3,g2,m3,g4,w3],
            ["",w3,w3,m5,w3,w3,w3,m5,w3,w3],
            ["",m5,"","","","","","","",""],
            ["",w3,"",w3,w3,"",w3,w3,"",w3],
            [g1,w3,"",w3,w3,"",w3,w3,"",w3],
            [m1,w3,m5,w3,w3,m4,w3,w3,m4,w3],
            [m1,w3,m5,w3,w3,g2,w3,w3,m4,w3],
            [up,w3,g5,w3,w3,g4,w3,w3,g3,w3]
        ],
        [
            [up,m3,"",m2,m2,"",m3,m5,"",""],    //3
            ["",g3,w1,w1,w1,"",w2,g5,m4,g1],
            ["",w1,w1,g9,w1,"",w1,m5,w1,m3],
            ["",w1,m3,m3,w1,"",w1,m3,w1,m3],
            ["",w1,m3,m3,w1,"",w1,m4,w1,g2],
            [m3,g2,"",w1,w1,"",w1,g3,w1,""],
            ["",m3,"",m3,m4,g1,w1,"",w1,""],
            ["",w1,g4,w1,w1,m2,w1,g4,m4,m4],
            [m2,m2,"",w1,w1,m1,m1,m2,w1,g5],
            [st,"",m3,g1,w1,p1,dn,g1,w1,rd]
        ],
        [
            [w1,w1,m3,m3,m3,"","",g5,w1,dn],    //4
            [g5,w1,"",m2,w1,"",w1,w1,w1,p1],
            [m5,w1,"",m3,w1,"",w1,g9,m4,m2],
            ["","",m4,m4,m3,"",w1,w1,w1,m1],
            ["","","",g4,w1,"","","",w1,g1],
            [g1,w1,w1,w1,w1,"","",g3,w1,g1],
            ["",m3,g1,g4,w1,"",w1,w1,w1,""],
            ["","",m3,m3,w1,"",m4,g1,m3,""],
            [w1,w1,"","",w1,"","",m5,w1,m3],
            [up,"",m4,"","",m5,"","",w1,g4]
        ],
        [
            [w1,"","","","",m4,g2,w1,w1,w1],   //5
            [w1,m3,"",w1,"",w1,w1,w1,g1,g1],
            [w1,g2,m4,w1,"","","",m5,g1,g1],
            [w1,m3,"",w1,w1,w1,"",w1,w1,w1],
            [w1,m3,"",w1,up,w1,m4,g1,m5,w1],
            [w1,g2,m3,g4,m5,w1,"",m5,g5,w1],
            [w1,m4,w1,w1,w1,w1,"",w1,w1,w1],
            ["","","",w1,m4,"","",w1,dn,w1],
            ["",m5,"",w1,"",m4,m3,g1,p1,w1],
            [m5,g7,m5,w1,g4,"",w1,w1,w1,w1]
        ],
        [
            [w4,w4,w4,w4,w4,w4,w4,w4,w4,w4],   //6
            [w4,w4,w4,w1,w1,w1,w1,w1,w4,w4],
            [w4,w4,w4,w1,"",g2,"",w1,w4,w4],
            [w4,w4,w4,w1,g2,gB,g2,w1,w4,w4],
            [w4,w4,w4,w1,"",g2,"",w1,w4,w4],
            [w4,w4,w4,w1,w1,m8,w1,w1,w4,w4],
            [w4,w4,w4,w4,w4,"",w4,w4,w4,w4],
            [w4,w4,w4,w4,w4,"",w4,w4,w4,w4],
            [w4,w4,w4,w4,w4,"",w4,w4,w4,w4],
            [dn,p1,"","","","","","","",up]
        ],
        [
            [w1,"","",m1,m1,"","","",p1,dn],    //7
            [w1,"","",m1,w1,g6,w1,w1,"",""],
            [st,m5,"",m1,w1,"",w1,g1,w1,""],
            [w1,"","",m1,w1,"",w1,g1,w1,""],
            [w1,w1,"",m1,w1,"",w1,"",w1,""],
            ["","","",m6,w1,"",w1,m5,w1,""],
            [m4,m4,m4,"","","",w1,"","",""],
            ["","",m6,w1,w1,m7,w1,w1,"",""],
            [m6,w1,g5,w1,"","","",w1,"",""],
            [up,w1,g5,w1,"",g8,"",w1,g2,g2]
        ],
        [
            ["","","","","","","","","",""],    //8
            ["","","","",w3,w3,w3,"","",""],
            ["","","","",w3,m9,w3,"","",""],
            ["","","","",w3,"",w3,"","",""],
            ["","","","","","","","","",""],
            ["","","","","","","","","",""],
            [g2,g2,g2,g1,g1,g1,g1,g4,g4,g4],
            ["","","","",m7,m7,"","","",""],
            [w3,w3,w3,w3,"","",w3,w3,w3,w3],
            [p1,"","","","","","","","",""]
        ],
        [
            ["","","","","","",w1,w1,"",""],     //9
            [w1,w1,w1,w1,w1,"",w1,"","",w1],
            ["","","","",w1,"",w1,w1,"",w1],
            ["",w1,w1,"",w1,"",w1,"","",""],
            ["","",w1,"",w1,"",w1,"",w1,""],
            ["","",w1,"","","","","",w1,""],
            ["","",w1,"",w1,w1,w1,w1,w1,""],
            [w1,w1,w1,"","","","","","",""],
            ["","",w1,w1,"",w1,w1,w1,w1,""],
            [w1,"","","",p1,"","","","",""]
        ]
    ];
    MapInit(floor);
    $floor.text("第" + (floor+1) + "层");
    statusUp();
    $bgm.play();
}
